out/note/mathematics/geometry/understanding-geometric-algebra.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/mathematics/geometry/understanding-geometric-algebra.org</title>
</head>
<body>
<pre>#+title: understanding geometric algebra

- hamilton, grassmann, and clifford for computer vision and graphics
- by kenichi kanatani, 2011

* 1 Introduction

* 2 3D Euclidean Geometry

*** intro

    - In this chapter,
      a vector is a geometric object
      equipped with direction and magnitude,
      not an array of numbers.

      Here, we present an &quot;algebraic&quot; description
      of 3D Euclidean geometry, representing objects by &quot;symbols&quot;
      and defining &quot;operations&quot; on them.

* 3 Oblique Coordinate Systems

* 4 Hamilton’s Quaternion Algebra

* 5 Grassmann’s Outer Product Algebra

* 6 Geometric Product and Clifford Algebra

* 7 Homogeneous Space and Grassmann–Cayley Algebra

* 8 Conformal Space and Conformal Geometry: Geometric Algebra

* 9 Camera Imaging and Conformal Transformations
</pre>
</body>
</html>
